{
	"title": "Advanced YT-dlp args guide",
	"contents": [
        { "Text": "[[[hyperlink:yt-dlp][https://github.com/yt-dlp/yt-dlp]]] is an external programme used to download and parse certain information." },

        { "Header2": "Why use yt-dlp instead of making my own?" },
        { "Text": "yt-dlp has thousands of people working on it to keep it up to date - one sole developer could never do this." },
        { "Text": "That is why, for flexibility for supported websites, yt-dlp is used," },
        { "Text": "and this will keep this programme relevant for a long time." },
        { "Separator": null },

        { "Header2": "Args:" },
        { "Text": "Args are passed to yt-dlp in order for it to know what/how to download." },
        { "Text": "Here are links to pages in the yt-dlp wiki to read about args:" },
        { "Text": "• [[[hyperlink:Usage and Options][https://github.com/yt-dlp/yt-dlp?tab=readme-ov-file#usage-and-options]]] - Used to get an idea of how it works." },
        { "Text": "• [[[hyperlink:Output Template][https://github.com/yt-dlp/yt-dlp?tab=readme-ov-file#output-template]]] - Used to specify a folder's output format. (Warning about removing the ID at the end of the template - this is used in the deduplicate detector.)" },
        { "Text": "• [[[hyperlink:Post-processing Options][https://github.com/yt-dlp/yt-dlp?tab=readme-ov-file#post-processing-options]]] - Used to show more flags useful to understand the structure of the default args." },

        { "Text": "From this point onwards, it assumes you have used yt-dlp before and understand how to interface with it." },
        { "Text": "Now the next best thing to do is look at the default args in the settings menu," },
        { "Text": "then look at the args on the site and add or remove args you want to add with testing in command line/terminal beforehand." },
        { "Text": "This allows you to be able to customise the args to fit your needs - you can even hardcode formats into the args," },
        { "Text": "so you can download MP4 using -f mp4 in the args as an example, then use that on a playlist you want to download in MP4." }
    ]
}
